CRYPTO_CURRENCIES = {
    "BTC": {"id": "bitcoin"},
    "ETH": {"id": "ethereum"},
    "SOL": {"id": "solana"},
    "TON": {"id": "the-open-network"},
}

ALL_CURRENCIES = {
    "RUB": ["₽", "rub", "руб", "рубля", "рублей", "рубль", "🇷🇺"],
    "USD": ["$", "usd", "доллар", "долларов", "доллара", "бакс","баксов", "бакса", "юзд", "🇺🇸"],
    "EUR": ["€", "eur", "евро", "🇪🇺"],
    "BYN": ["Br", "byn", "бун", "бел рублей", "🇧🇾"],
    "KZT": ["₸", "kzt", "тенге","tenge","🇰🇿"],
    "PLN": ["zł", "pln", "злотых", "🇵🇱"],
    "UAH": ["₴", "uah", "гривна", "гривен", "🇺🇦"],
    "BTC": ["btc", "биткоин", "bitcoin", "биток", "биткоинов", "биткоина"],
    "ETH": ["eth", "эфир", "эфира", "эфиров", "ethereum"],
    "SOL": ["sol", "сол", "солан", "солана", "solana", "solan"],
    "TON": ["ton", "тон", "тонн", "тоннов", "тонов", "tonn"]
}

CURRENCY_FLAGS = {
    "USD": "🇺🇸",
    "EUR": "🇪🇺",
    "BYN": "🇧🇾",
    "RUB": "🇷🇺",
    "KZT": "🇰🇿",
    "PLN": "🇵🇱",
    "UAH": "🇺🇦",
    "BTC": "💰",
    "ETH": "💰",
    "SOL": "💰",
    "TON": "💰"
}