CRYPTO_CURRENCIES = {
    "BTC": {"id": "bitcoin"},
    "ETH": {"id": "ethereum"},
    "SOL": {"id": "solana"},
    "TON": {"id": "the-open-network"},
}

ALL_CURRENCIES = {
    "RUB": [
        "₽", "rub", "RUB", "ruble", "rouble", "rubles", "rur", "RUR",
        "руб", "руб.", "рубль", "рубля", "рублей", "рубли", "рублю", "рублях", "рублям", "рублями",
        "р", "р.",
        "российский рубль", "рос рубль",
        "рубас", "рубасов",
        "🇷🇺"
    ],
    "USD": [
        "$", "usd", "USD",
        "доллар", "доллара", "долларов", "доллары", "долларах", "долларами",
        "дол", "дол.", "долл", "долл.",
        "бакс", "бакса", "баксов", "баксы", "баксах",
        "us$", "u$", "usd$", "us dollar", "u.s. dollar", "usa dollar",
        "доллар сша", "доллары сша", "долларов сша",
        "🇺🇸", "💵"
    ],
    "EUR": [
        "€", "eur", "EUR", "euro", "euros", "EURO",
        "евро", "евра", "евры",
        "еврик", "еврика", "евриков",
        "евр", "евр.",
        "🇪🇺", "💶"
    ],
    "BYN": [
        "Br", "BR", "byn", "BYN", "byr", "BYR", "blr", "BLR",
        "бел рублей", "белрублей", "белруб", "бел руб", "бел.руб", "бел. руб",
        "белорусский рубль", "белорусского рубля", "белорусские рубли", "белорусских рублей", "белорусских рублях",
        "🇧🇾"
    ],
    "KZT": [
        "₸", "kzt", "KZT",
        "тенге", "тэнге", "тенгах",
        "тг", "тг.", "тнг",
        "tenge", "tg",
        "казахский тенге", "каз тенге",
        "🇰🇿"
    ],
    "PLN": [
        "zł", "zl", "zl.", "PLN", "pln", "PLZ", "plz",
        "zloty", "zlotys", "zlotych",
        "польский злотый", "польских злотых", "польские злотые",
        "злотый", "злотого", "злотых", "злотые", "злотыми",
        "зл", "зл.",
        "🇵🇱"
    ],
    "UAH": [
        "₴", "uah", "UAH",
        "грн", "грн.",
        "гривна", "гривны", "гривен", "гривне", "гривну", "гривнях", "гривнами",
        "hryvnia", "hryvnya", "grivna",
        "🇺🇦"
    ],
    "BTC": [
        "btc", "BTC", "xbt", "XBT", "₿",
        "bitcoin", "биткоин", "биткойн",
        "биток", "битка", "битков",
        "биткоина", "биткоинов", "биткойна", "биткойнов",
        "бтс", "бтц",
        "satoshi", "sats", "sat", "сатоши", "сат", "сатов", "сатошей"
    ],
    "ETH": [
        "eth", "ETH", "ethereum", "Ether", "Ξ",
        "эфир", "эфира", "эфиров", "эфиры", "эфиром",
        "эфириум", "эфириума", "эфириумов",
        "етх", "ефир"
    ],
    "SOL": [
        "sol", "SOL", "solana", "Solana",
        "сол", "сола", "солы",
        "солан", "солана", "соланы", "solan"
    ],
    "TON": [
        "ton", "TON", "toncoin", "TONCOIN",
        "тон", "тона", "тонов", "тонн", "тоннов",
        "тонкоин", "тон коин"
    ]
}

CURRENCY_FLAGS = {
    "USD": "🇺🇸",
    "EUR": "🇪🇺",
    "BYN": "🇧🇾",
    "RUB": "🇷🇺",
    "KZT": "🇰🇿",
    "PLN": "🇵🇱",
    "UAH": "🇺🇦",
    "BTC": "💰",
    "ETH": "💰",
    "SOL": "💰",
    "TON": "💰"
}